# Задача 1

# a = input("Ведите строку: ")
# print(a[:a.find('h')] + a[a.rfind('h') + 1:])

# Задача 2

# a = input("Ведите строку: ")
# print(a[:a.find('h') + 1] + a[a.find('h') + 1:a.rfind('h')][::-1] + a[a.rfind('h'):])

# Задача 3

# Вариант 1

# a = input("Строка: ")
# print(a.replace(input("Ее заменяемая подстрока: "), input("Новая подстрока: ")))

# Вариант 2

# a, b, c = input("Строка: "), input("Ее заменяемая подстрока: "), input("Новая подстрока: ")
# print(*[c if i == b else i for i in a.split() ])

# Задача 4

# a = """
# Ежевику для ежат
# Принесли два ежа.
# Ежевику еле-еле
# Ежата возле ели съели.
# """
#
# print("Количество слов:", len([i for i in a.lower().split() if i[0] == 'е']))